In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('supershops.csv')

In [3]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [5]:
x = df.drop('Profit', axis=1) # 1 for column

In [6]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [7]:
y = df['Profit']

In [8]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# Standard Scaler

In [9]:
from sklearn.preprocessing import StandardScaler
std = StandardScaler()

In [10]:
df_ad = std.fit(df[['Administration']])

In [11]:
df_ad

StandardScaler()

In [12]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [13]:
df.Administration = std.transform(df[['Administration']])

In [14]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.560753  471784.10    Dhaka  192261.83
1        162597.70        1.082807  443898.53      Ctg  191792.06
2        153441.51       -0.728257  407934.54  Rangpur  191050.39
3        144372.41       -0.096365  383199.62    Dhaka  182901.99
4        142107.34       -1.079919  366168.42  Rangpur  166187.94

In [15]:
df.Transport = std.fit_transform(df[['Transport']])

In [16]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.560753   2.165287    Dhaka  192261.83
1        162597.70        1.082807   1.929843      Ctg  191792.06
2        153441.51       -0.728257   1.626191  Rangpur  191050.39
3        144372.41       -0.096365   1.417348    Dhaka  182901.99
4        142107.34       -1.079919   1.273550  Rangpur  166187.94

# Assignment

In [46]:
#LOOP Standard Scaler

In [50]:
x_2 = x.drop('Area', axis=1)
x_2.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [52]:
from sklearn.preprocessing import StandardScaler

std = StandardScaler()

for column in x_2.columns:
    x_2[column] = std.fit_transform(x_2[[column]])

In [53]:
x_2.head()

   Marketing Spend  Administration  Transport
0         0.897913        0.560753   2.165287
1         1.955860        1.082807   1.929843
2         1.754364       -0.728257   1.626191
3         1.554784       -0.096365   1.417348
4         1.504937       -1.079919   1.273550

In [74]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
dtypes: float64(3), object(1)
memory usage: 1.7+ KB

In [82]:
from sklearn.preprocessing import StandardScaler

std = StandardScaler()

for column in x.columns:
    if not x.dtypes[column] == object:
#         print(column)
        x[column] = std.fit_transform(x[[column]])

Marketing Spend
Administration
Transport

In [81]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

In [27]:
# MinMax Scaler
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MinMaxScaler.html

from sklearn.preprocessing import MinMaxScaler

min_max_scale = MinMaxScaler()
df['Marketing Spend'] = min_max_scale.fit_transform(df[['Marketing Spend']])

In [28]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.560753   2.165287    Dhaka  192261.83
1         0.983359        1.082807   1.929843      Ctg  191792.06
2         0.927985       -0.728257   1.626191  Rangpur  191050.39
3         0.873136       -0.096365   1.417348    Dhaka  182901.99
4         0.859438       -1.079919   1.273550  Rangpur  166187.94

In [20]:
#Max Abs Scaler

In [24]:
from sklearn.preprocessing import MaxAbsScaler

max_abs_scale = MaxAbsScaler()
df['Marketing Spend'] = max_abs_scale.fit_transform(df[['Marketing Spend']])

In [25]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.560753   2.165287    Dhaka  192261.83
1         0.983359        1.082807   1.929843      Ctg  191792.06
2         0.927985       -0.728257   1.626191  Rangpur  191050.39
3         0.873136       -0.096365   1.417348    Dhaka  182901.99
4         0.859438       -1.079919   1.273550  Rangpur  166187.94

In [29]:
#Robus Scaler

In [30]:
from sklearn.preprocessing import RobustScaler

In [31]:
robust_Scaler = RobustScaler()

In [32]:
df['Marketing Spend'] = robust_Scaler.fit_transform(df[['Marketing Spend']])

In [33]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.560753   2.165287    Dhaka  192261.83
1         1.452113        1.082807   1.929843      Ctg  191792.06
2         1.303634       -0.728257   1.626191  Rangpur  191050.39
3         1.156567       -0.096365   1.417348    Dhaka  182901.99
4         1.119836       -1.079919   1.273550  Rangpur  166187.94